Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG00-S1/edc/PIC32CK1025SG00064S1.PIC
      <edc:SFRDef ltx:memberofperipheral="CSM" edc:cname="CSMCTRLB" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x57000004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CSM">
            <edc:SFRFieldDef edc:cname="ERROR" edc:nzwidth="0x1" edc:desc="Error Interrupt Request bit."/>
            <edc:SFRFieldDef edc:cname="TAMPER" edc:nzwidth="0x1" edc:desc="Tamper Interrupt Request bit."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CSM" edc:cname="CSMINTENCLR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x57000008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CSM">
            <edc:SFRFieldDef edc:cname="CANCEL" edc:nzwidth="0x1" edc:desc="Cancel Command Interrupt Enable bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CSM" edc:cname="CSMINTENSET" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x5700000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CSM">
            <edc:SFRFieldDef edc:cname="CANCEL" edc:nzwidth="0x1" edc:desc="Cancel Command Interrupt Enable bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CSM" edc:cname="CSMINTFLAG" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x57000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CSM">
            <edc:SFRFieldDef edc:cname="CANCEL" edc:nzwidth="0x1" edc:desc="Cancel Command Interrupt Flag bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CSM" edc:cname="CSMSTATUS" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x57000014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CSM">
            <edc:SFRFieldDef edc:cname="OTPLOCK" edc:nzwidth="0x1" edc:desc="OTP Lock bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CSM" edc:cname="CSMREPORT" edc:nzwidth="0x20" edc:access="------------nnnn-nnn-nnn-nnn---n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF7771" edc:_addr="0x57000018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CSM">
            <edc:SFRFieldDef edc:cname="BUSY" edc:nzwidth="0x1" edc:desc="HSM CPU Busy"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PS" edc:nzwidth="0x3" edc:desc="Processing State bits"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LCS" edc:nzwidth="0x3" edc:desc="Lifecycle State bits"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SBS" edc:nzwidth="0x3" edc:desc="Secure Boot State bits"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ECODE" edc:nzwidth="0x4" edc:desc="Error Code"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xE4" edc:_addr="0x5700001C"/>
      <edc:SFRDef ltx:memberofperipheral="AI" edc:cname="AIOFFSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x57000100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AI">
            <edc:SFRFieldDef edc:cname="OFFSET" edc:nzwidth="0x20" edc:desc="Address Offset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AI" edc:cname="AIATTR" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x57000104">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AI">
            <edc:SFRFieldDef edc:cname="NSM" edc:nzwidth="0x1" edc:desc="Non Secure Master"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xF8" edc:_addr="0x57000108"/>
      <edc:SFRDef ltx:memberofperipheral="PKRAM" edc:cname="PKRPCTRL" edc:nzwidth="0x20" edc:access="-----------------nnnnnnn------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F03" edc:_addr="0x57000200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PKRAM">
            <edc:SFRFieldDef edc:cname="PARITY" edc:nzwidth="0x1" edc:desc="RAM Parity Enable bit (1)"/>
            <edc:SFRFieldDef edc:cname="FLTEN" edc:nzwidth="0x1" edc:desc="Fault Injection Enable bit"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="FLTPTR" edc:nzwidth="0x7" edc:desc="Fault Injection Bit Pointer bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PKRAM" edc:cname="PKRPERROR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x57000204">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PKRAM">
            <edc:SFRFieldDef edc:cname="PARITY" edc:nzwidth="0x1" edc:desc="PK RAM Parity Error bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xF8" edc:_addr="0x57000208"/>
      <edc:SFRDef ltx:memberofperipheral="MCRAMC" edc:cname="CTRLA" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:por="00000000000000000000000000000010" edc:mclr="00000000000000000000000000000010" edc:impl="0x3" edc:_addr="0x57000300">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="No effect." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="Reset the MCRAMC. A software-triggered hardware reset of the MCRAMC user interface is performed." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC Decoder Enable">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="ECC decoding is disabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="ECC decoding is enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCRAMC" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7" edc:_addr="0x57000304">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software reset busy bit"/>
            <edc:SFRFieldDef edc:cname="FLTEN" edc:nzwidth="0x1" edc:desc="Fault Injection Enabled busy bit"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC Decoder Enable busy bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCRAMC" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x57000308">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="SERREN" edc:nzwidth="0x1" edc:desc="Single Bit Error Interrupt Enable, Clear"/>
            <edc:SFRFieldDef edc:cname="DERREN" edc:nzwidth="0x1" edc:desc="Double Bit Error Interrupt Enable, Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
